// перебрати циклом while та вивести  числа тільки з непарним індексом
let arr = [2,17,13,6,22,31,45,66,100,-18];
let i = 0;
while (i < arr.length){
    if(arr.indexOf(arr[i])%2){
        console.log(arr[i]);
    }
    i++;
}
console.log('----------------------');

//перебрати циклом for та вивести  числа тільки парні  значення
for (let j = 0; j <arr.length; j++) {
    if (arr[j] % 2 !== 1){
        console.log(arr[j]);
    }
}
console.log('----------------------');

//замінити кожне число кратне 3 на слово "okten"
let arr2 = [2,17,13,6,22,31,45,66,100,-18];
for (let j = 0; j <arr2.length; j++) {
    if (arr2[j] % 3 === 0){
        arr2[j] = 'okten';
    }
}
console.log(arr2);

//вивести масив в зворотньому порядку.
let a = arr.reverse();
console.log(a);

// Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
// Вивести в консоль всі його елементи в циклі.



