// Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3,
// то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
// Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3){
    console.log('великий масив');
}else {
    console.log('маленький масив');
}

// Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
// Знайти, яке з них є середнім (більше одного, але менше за інше).
// Перевірити, чи знаходиться перше число між двома іншими.
let a = 99;
let b = 333;
let c = 33;
if(a > b && a < c || a < b && a > c){
    console.log('its a')
}else if(b > a && b < c || b < a && b > c){
    console.log('its b')
}else if(c > a && c < b || c < a && c > b){
    console.log('its c')
}

// Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
let result = (a + b < 4) ? 'Мало': 'Багато';

// Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
let f = -1.1;
let num = (f < 0) ? 'негативним': (f > 0)? 'позитивним': 'нулем';
console.log(num);

// У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false.
// Напишіть два варіанти скрипта - з коротким записом(тернаркою)
let test = false;
if(test){
    console.log('Вірно');
}else {
    console.log('Неправильно')
}
rs = (test) ? 'Вірно' : 'Неправильно';
console.log(rs);

// Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!



















